### Restart and Run All

In [1]:
import pandas as pd
from datetime import date, timedelta
from sqlalchemy import create_engine

engine = create_engine('sqlite:///c:\\ruby\\portlt\\db\\development.sqlite3')
conlt = engine.connect()

pd.set_option('display.float_format','{:,.2f}'.format)
pd.set_option('display.max_rows',None)

year = 2022
quarter = 1

today = date.today()
today

datetime.date(2022, 2, 14)

In [2]:
sql = '''
SELECT name,year,quarter,q_amt 
FROM epss 
WHERE (year = %s AND quarter <= %s)
OR (year = %s-1 AND quarter >= %s+1) 
ORDER BY year DESC, quarter DESC'''
sql = sql % (year, quarter, year, quarter)
dfc = pd.read_sql(sql, conlt)
dfc['Counter'] = 1
dfc_grp = dfc.groupby(['name'], as_index=False).sum()
dfc_grp = dfc_grp[dfc_grp['Counter'] == 4]
dfc_grp

       name  year  quarter     q_amt  Counter
17      AOT  8085       10 -17151697        4
65    COTTO  8085       10    980148        4
111  GVREIT  8085       10    672205        4
134     IRC  8085       10    245994        4
187   OISHI  8085       10    709629        4

In [3]:
sql = '''
SELECT name,year,quarter,q_amt 
FROM epss 
WHERE (year = %s AND quarter <= %s-1) 
OR (year = %s-1 AND quarter >= %s) 
ORDER BY year DESC, quarter DESC'''
sql = sql % (year, quarter, year, quarter)
print(sql)

SELECT name,year,quarter,q_amt
FROM epss
WHERE (year = 2022 AND quarter <= 1-1)
OR (year = 2022-1 AND quarter >= 1)
ORDER BY year DESC, quarter DESC

In [4]:
dfp = pd.read_sql(sql, conlt)
dfp['Counter'] = 1
dfp_grp = dfp.groupby(['name'], as_index=False).sum()
dfp_grp = dfp_grp[dfp_grp['Counter'] == 4]
dfp_grp.shape

(40, 5)

In [5]:
dfm = pd.merge(dfc_grp, dfp_grp, on='name', suffixes=(['_c','_p']), how='inner')
dfm['inc_profit'] = dfm['q_amt_c']-dfm['q_amt_p']
dfm['Pct'] = round(dfm['inc_profit']/abs(dfm['q_amt_p'])*100,2)
dfm['year'] = year
dfm['quarter'] = 'Q'+str(quarter)
df_pct = dfm[['name','year','quarter','q_amt_c','q_amt_p','inc_profit','Pct']]
df_pct

     name  year quarter   q_amt_c   q_amt_p  inc_profit    Pct
0     AOT  2022      Q1 -17151697 -16322014     -829683  -5.08
1   COTTO  2022      Q1    980148    583604      396544  67.95
2  GVREIT  2022      Q1    672205    705215      -33010  -4.68
3     IRC  2022      Q1    245994    340031      -94037 -27.66
4   OISHI  2022      Q1    709629    546690      162939  29.80

In [6]:
sql = """
DELETE FROM qt_profits 
WHERE year = %s AND quarter = 'Q%s'"""
sql = sql % (year,quarter)
print(sql)

DELETE FROM qt_profits
WHERE year = 2022 AND quarter = 'Q1'

In [7]:
rp = conlt.execute(sql)
rp.rowcount

2

In [8]:
sql = 'SELECT name, id FROM tickers'
tickers = pd.read_sql(sql, conlt)
tickers.shape

(403, 2)

In [9]:
df_ins = pd.merge(df_pct, tickers, on='name', how='inner')
df_ins.dtypes

name           object
year            int64
quarter        object
q_amt_c         int64
q_amt_p         int64
inc_profit      int64
Pct           float64
id              int64
dtype: object

In [10]:
rcds = df_ins.values.tolist()
len(rcds)

5

In [11]:
for rcd in rcds:
    print(rcd)

['AOT', 2022, 'Q1', -17151697, -16322014, -829683, -5.08, 24]
['COTTO', 2022, 'Q1', 980148, 583604, 396544, 67.95, 710]
['GVREIT', 2022, 'Q1', 672205, 705215, -33010, -4.68, 654]
['IRC', 2022, 'Q1', 245994, 340031, -94037, -27.66, 225]
['OISHI', 2022, 'Q1', 709629, 546690, 162939, 29.8, 338]

In [12]:
sql = """
INSERT INTO qt_profits (name, year, quarter, latest_amt, previous_amt, inc_amt, inc_pct, ticker_id) \
 VALUES (?, ?, ?, ?, ?, ?, ?, ?)"""
print(sql)

INSERT INTO qt_profits (name, year, quarter, latest_amt, previous_amt, inc_amt, inc_pct, ticker_id)  VALUES (?, ?, ?, ?, ?, ?, ?, ?)

In [13]:
for rcd in rcds:
    conlt.execute(sql, rcd)

### End of loop

In [14]:
cols = 'name year quarter q_amt_c q_amt_p inc_profit Pct'.split()

In [15]:
criteria_1 = df_ins.q_amt_c > 440000
df_ins.loc[criteria_1,cols].sort_values(['Pct'],ascending=[False]).head()

     name  year quarter  q_amt_c  q_amt_p  inc_profit   Pct
1   COTTO  2022      Q1   980148   583604      396544 67.95
4   OISHI  2022      Q1   709629   546690      162939 29.80
2  GVREIT  2022      Q1   672205   705215      -33010 -4.68

In [16]:
criteria_2 = df_ins.q_amt_p > 400000
df_ins.loc[criteria_2,cols].sort_values(['Pct'],ascending=[False]).head()

     name  year quarter  q_amt_c  q_amt_p  inc_profit   Pct
1   COTTO  2022      Q1   980148   583604      396544 67.95
4   OISHI  2022      Q1   709629   546690      162939 29.80
2  GVREIT  2022      Q1   672205   705215      -33010 -4.68

In [17]:
criteria_3 = df_ins.Pct > 10
df_ins.loc[criteria_3,cols].sort_values(['Pct'],ascending=[False]).head()

    name  year quarter  q_amt_c  q_amt_p  inc_profit   Pct
1  COTTO  2022      Q1   980148   583604      396544 67.95
4  OISHI  2022      Q1   709629   546690      162939 29.80

In [18]:
df_ins_criteria = criteria_1 & criteria_2 & criteria_3
df_ins.loc[df_ins_criteria,cols].sort_values(['Pct'],ascending=[False]).head()

    name  year quarter  q_amt_c  q_amt_p  inc_profit   Pct
1  COTTO  2022      Q1   980148   583604      396544 67.95
4  OISHI  2022      Q1   709629   546690      162939 29.80